cfd/cases/hull_M3_streamlined_U02/system/topoSetDict.2
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// robot_simple 第 2 级加密盒，由 setup_robot.sh 生成
actions
(
    {
        name    c0;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (-0.2880 -0.1578 -0.0949) (0.1980 0.1578 0.0655);
    }
);
