cfd/cases/hull_M3_streamlined_U02/system/topoSetDict.4
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// robot_simple 第 4 级加密盒，由 setup_robot.sh 生成
actions
(
    {
        name    c0;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (-0.1780 -0.0928 -0.0649) (0.1630 0.0928 0.0355);
    }
);
