cfd/cases/hull_M3_streamlined_U02/system/topoSetDict.5
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// robot_simple 第 5 级加密盒，由 setup_robot.sh 生成
actions
(
    {
        name    c0;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (-0.1580 -0.0778 -0.0568) (0.1530 0.0778 0.0275);
    }
);
